lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal_security.cpp
#include "nrf54l15_hal.h"

namespace xiao_nrf54l15 {

namespace {

constexpr uint32_t kKmuSlotMax = KMU_KEYSLOT_ID_Max;
constexpr uint32_t kTampcWriteKey =
    (TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_KEY_KEY
     << TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_KEY_Pos);
constexpr uint32_t kTampcWriteProtectionClear =
    (TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_WRITEPROTECTION_Clear
     << TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_WRITEPROTECTION_Pos);
constexpr uint32_t kTampcLockEnabled =
    (TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_LOCK_Enabled
     << TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_LOCK_Pos);

inline bool validKmuSlot(uint8_t slot) {
  return slot <= kKmuSlotMax;
}

bool waitRramcReady(NRF_RRAMC_Type* rramc, uint32_t spinLimit) {
  if (rramc == nullptr) {
    return false;
  }
  while (spinLimit-- > 0U) {
    if (((rramc->READY & RRAMC_READY_READY_Msk) >> RRAMC_READY_READY_Pos) ==
        RRAMC_READY_READY_Ready) {
      return true;
    }
  }
  return false;
}

}  // namespace

Kmu::Kmu(uint32_t base, uint32_t rramcBase)
    : kmu_(reinterpret_cast<NRF_KMU_Type*>(base)),
      rramc_(reinterpret_cast<NRF_RRAMC_Type*>(rramcBase)) {}

bool Kmu::ready() const {
#if defined(NRF_TRUSTZONE_NONSECURE)
  return false;
#else
  if (kmu_ == nullptr) {
    return false;
  }
  return ((kmu_->STATUS & KMU_STATUS_STATUS_Msk) >> KMU_STATUS_STATUS_Pos) ==
         KMU_STATUS_STATUS_Ready;
#endif
}

void Kmu::clearEvents() {
  if (kmu_ == nullptr) {
    return;
  }
  kmu_->EVENTS_PROVISIONED = 0U;
  kmu_->EVENTS_PUSHED = 0U;
  kmu_->EVENTS_REVOKED = 0U;
  kmu_->EVENTS_ERROR = 0U;
  kmu_->EVENTS_METADATAREAD = 0U;
  kmu_->EVENTS_PUSHBLOCKED = 0U;
}

bool Kmu::pollProvisioned(bool clearEvent) {
  if (kmu_ == nullptr) {
    return false;
  }
  const bool signaled = ((kmu_->EVENTS_PROVISIONED &
                          KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Msk) >>
                         KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Pos) ==
                        KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Generated;
  if (signaled && clearEvent) {
    kmu_->EVENTS_PROVISIONED = 0U;
  }
  return signaled;
}

bool Kmu::pollPushed(bool clearEvent) {
  if (kmu_ == nullptr) {
    return false;
  }
  const bool signaled =
      ((kmu_->EVENTS_PUSHED & KMU_EVENTS_PUSHED_EVENTS_PUSHED_Msk) >>
       KMU_EVENTS_PUSHED_EVENTS_PUSHED_Pos) ==
      KMU_EVENTS_PUSHED_EVENTS_PUSHED_Generated;
  if (signaled && clearEvent) {
    kmu_->EVENTS_PUSHED = 0U;
  }
  return signaled;
}

bool Kmu::pollRevoked(bool clearEvent) {
  if (kmu_ == nullptr) {
    return false;
  }
  const bool signaled =
      ((kmu_->EVENTS_REVOKED & KMU_EVENTS_REVOKED_EVENTS_REVOKED_Msk) >>
       KMU_EVENTS_REVOKED_EVENTS_REVOKED_Pos) ==
      KMU_EVENTS_REVOKED_EVENTS_REVOKED_Generated;
  if (signaled && clearEvent) {
    kmu_->EVENTS_REVOKED = 0U;
  }
  return signaled;
}

bool Kmu::pollMetadataRead(bool clearEvent) {
  if (kmu_ == nullptr) {
    return false;
  }
  const bool signaled =
      ((kmu_->EVENTS_METADATAREAD &
        KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Msk) >>
       KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Pos) ==
      KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Generated;
  if (signaled && clearEvent) {
    kmu_->EVENTS_METADATAREAD = 0U;
  }
  return signaled;
}

bool Kmu::pollPushBlocked(bool clearEvent) {
  if (kmu_ == nullptr) {
    return false;
  }
  const bool signaled =
      ((kmu_->EVENTS_PUSHBLOCKED &
        KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Msk) >>
       KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Pos) ==
      KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Generated;
  if (signaled && clearEvent) {
    kmu_->EVENTS_PUSHBLOCKED = 0U;
  }
  return signaled;
}

bool Kmu::pollError(bool clearEvent) {
  if (kmu_ == nullptr) {
    return false;
  }
  const bool signaled =
      ((kmu_->EVENTS_ERROR & KMU_EVENTS_ERROR_EVENTS_ERROR_Msk) >>
       KMU_EVENTS_ERROR_EVENTS_ERROR_Pos) ==
      KMU_EVENTS_ERROR_EVENTS_ERROR_Generated;
  if (signaled && clearEvent) {
    kmu_->EVENTS_ERROR = 0U;
  }
  return signaled;
}

bool Kmu::waitReady(uint32_t spinLimit) const {
  if (kmu_ == nullptr) {
    return false;
  }
  while (spinLimit-- > 0U) {
    if (ready()) {
      return true;
    }
  }
  return false;
}

bool Kmu::enableRramWrite(uint32_t* previousConfig, uint32_t spinLimit) const {
  if (previousConfig == nullptr || rramc_ == nullptr) {
    return false;
  }
  if (!waitRramcReady(rramc_, spinLimit)) {
    return false;
  }
  *previousConfig = rramc_->CONFIG;
  rramc_->CONFIG = *previousConfig | RRAMC_CONFIG_WEN_Msk;
  return waitRramcReady(rramc_, spinLimit);
}

void Kmu::restoreRramWrite(uint32_t previousConfig, uint32_t spinLimit) const {
  if (rramc_ == nullptr) {
    return;
  }
  (void)waitRramcReady(rramc_, spinLimit);
  rramc_->CONFIG = previousConfig;
  (void)waitRramcReady(rramc_, spinLimit);
}

bool Kmu::performSimpleTask(uint8_t slot,
                            volatile uint32_t& task,
                            volatile uint32_t& successEvent,
                            uint32_t spinLimit) {
#if defined(NRF_TRUSTZONE_NONSECURE)
  (void)slot;
  (void)task;
  (void)successEvent;
  (void)spinLimit;
  return false;
#else
  if (kmu_ == nullptr || !validKmuSlot(slot) || !waitReady(spinLimit)) {
    return false;
  }

  clearEvents();
  kmu_->KEYSLOT = static_cast<uint32_t>(slot);
  successEvent = 0U;
  kmu_->EVENTS_ERROR = 0U;
  task = 1U;

  while (spinLimit-- > 0U) {
    if ((successEvent & 1U) != 0U) {
      return true;
    }
    if ((kmu_->EVENTS_ERROR & 1U) != 0U) {
      return false;
    }
  }
  return false;
#endif
}

bool Kmu::readMetadata(uint8_t slot, uint32_t* metadata, uint32_t spinLimit) {
#if defined(NRF_TRUSTZONE_NONSECURE)
  (void)slot;
  (void)metadata;
  (void)spinLimit;
  return false;
#else
  if (metadata == nullptr) {
    return false;
  }
  if (!performSimpleTask(slot, kmu_->TASKS_READMETADATA,
                         kmu_->EVENTS_METADATAREAD, spinLimit)) {
    return false;
  }
  *metadata = kmu_->METADATA;
  return true;
#endif
}

bool Kmu::provision(uint8_t slot, const KmuProvisionSource& source,
                    uint32_t spinLimit) {
#if defined(NRF_TRUSTZONE_NONSECURE)
  (void)slot;
  (void)source;
  (void)spinLimit;
  return false;
#else
  if (kmu_ == nullptr || !validKmuSlot(slot) || !waitReady(spinLimit)) {
    return false;
  }
  if ((reinterpret_cast<uintptr_t>(&source) & 0xFUL) != 0U ||
      (source.destination & 0xFUL) != 0U) {
    return false;
  }

  uint32_t previousConfig = 0U;
  if (!enableRramWrite(&previousConfig, spinLimit)) {
    return false;
  }

