lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal_security.cpp
  clearEvents();
  kmu_->KEYSLOT = static_cast<uint32_t>(slot);
  kmu_->SRC = static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&source));
  kmu_->TASKS_PROVISION = KMU_TASKS_PROVISION_TASKS_PROVISION_Trigger;

  bool ok = false;
  while (spinLimit-- > 0U) {
    if ((kmu_->EVENTS_PROVISIONED & 1U) != 0U) {
      ok = true;
      break;
    }
    if ((kmu_->EVENTS_ERROR & 1U) != 0U) {
      break;
    }
  }

  restoreRramWrite(previousConfig, 600000UL);
  return ok;
#endif
}

bool Kmu::push(uint8_t slot, uint32_t spinLimit) {
  return performSimpleTask(slot, kmu_->TASKS_PUSH, kmu_->EVENTS_PUSHED,
                           spinLimit);
}

bool Kmu::revoke(uint8_t slot, uint32_t spinLimit) {
  return performSimpleTask(slot, kmu_->TASKS_REVOKE, kmu_->EVENTS_REVOKED,
                           spinLimit);
}

bool Kmu::pushBlock(uint8_t slot, uint32_t spinLimit) {
  return performSimpleTask(slot, kmu_->TASKS_PUSHBLOCK,
                           kmu_->EVENTS_PUSHBLOCKED, spinLimit);
}

CracenIkg::CracenIkg(uint32_t controlBase, uint32_t coreBase)
    : cracen_(reinterpret_cast<NRF_CRACEN_Type*>(controlBase)),
      core_(reinterpret_cast<NRF_CRACENCORE_Type*>(coreBase)),
      active_(false) {}

bool CracenIkg::begin(uint32_t spinLimit) {
#if defined(NRF_TRUSTZONE_NONSECURE)
  (void)spinLimit;
  return false;
#else
  if (cracen_ == nullptr || core_ == nullptr) {
    return false;
  }

  cracen_->ENABLE |= CRACEN_ENABLE_PKEIKG_Msk;
  active_ = true;
  clearEvent();
  return waitReady(spinLimit);
#endif
}

void CracenIkg::end() {
#if defined(NRF_TRUSTZONE_NONSECURE)
  active_ = false;
#else
  if (cracen_ == nullptr) {
    active_ = false;
    return;
  }
  cracen_->ENABLE &= ~CRACEN_ENABLE_PKEIKG_Msk;
  clearEvent();
  active_ = false;
#endif
}

bool CracenIkg::active() const { return active_; }

void CracenIkg::clearEvent() {
  if (cracen_ == nullptr) {
    return;
  }
  cracen_->EVENTS_PKEIKG = 0U;
}

uint32_t CracenIkg::status() const {
  return (core_ == nullptr) ? 0xFFFFFFFFUL : core_->IKG.STATUS;
}

uint32_t CracenIkg::pkeStatus() const {
  return (core_ == nullptr) ? 0xFFFFFFFFUL : core_->IKG.PKESTATUS;
}

uint32_t CracenIkg::hwConfig() const {
  return (core_ == nullptr) ? 0xFFFFFFFFUL : core_->IKG.HWCONFIG;
}

uint8_t CracenIkg::symmetricKeyCapacity() const {
  const uint32_t config = hwConfig();
  if (config == 0xFFFFFFFFUL) {
    return 0U;
  }
  return static_cast<uint8_t>(
      (config & CRACENCORE_IKG_HWCONFIG_NBSYMKEYS_Msk) >>
      CRACENCORE_IKG_HWCONFIG_NBSYMKEYS_Pos);
}

uint8_t CracenIkg::privateKeyCapacity() const {
  const uint32_t config = hwConfig();
  if (config == 0xFFFFFFFFUL) {
    return 0U;
  }
  return static_cast<uint8_t>(
      (config & CRACENCORE_IKG_HWCONFIG_NBPRIVKEYS_Msk) >>
      CRACENCORE_IKG_HWCONFIG_NBPRIVKEYS_Pos);
}

bool CracenIkg::okay() const {
  return (status() & CRACENCORE_IKG_STATUS_OKAY_Msk) != 0U;
}

bool CracenIkg::seedError() const {
  return (status() & CRACENCORE_IKG_STATUS_SEEDERROR_Msk) != 0U;
}

bool CracenIkg::entropyError() const {
  return (status() & CRACENCORE_IKG_STATUS_ENTROPYERROR_Msk) != 0U;
}

bool CracenIkg::catastrophicError() const {
  return (status() & CRACENCORE_IKG_STATUS_CATASTROPHICERROR_Msk) != 0U;
}

bool CracenIkg::ctrDrbgBusy() const {
  return (status() & CRACENCORE_IKG_STATUS_CTRDRBGBUSY_Msk) != 0U;
}

bool CracenIkg::symmetricKeysStored() const {
  return (status() & CRACENCORE_IKG_STATUS_SYMKEYSTORED_Msk) != 0U;
}

bool CracenIkg::privateKeysStored() const {
  return (status() & CRACENCORE_IKG_STATUS_PRIVKEYSTORED_Msk) != 0U;
}

bool CracenIkg::markSeedValid(bool valid) {
#if defined(NRF_TRUSTZONE_NONSECURE)
  (void)valid;
  return false;
#else
  if (cracen_ == nullptr) {
    return false;
  }
  cracen_->SEEDVALID = valid ? CRACEN_SEEDVALID_VALID_Enabled
                             : CRACEN_SEEDVALID_VALID_Disabled;
  return true;
#endif
}

bool CracenIkg::lockSeed() {
#if defined(NRF_TRUSTZONE_NONSECURE)
  return false;
#else
  if (cracen_ == nullptr) {
    return false;
  }
  cracen_->SEEDLOCK = CRACEN_SEEDLOCK_ENABLE_Enabled;
  return true;
#endif
}

bool CracenIkg::lockProtectedRam() {
#if defined(NRF_TRUSTZONE_NONSECURE)
  return false;
#else
  if (cracen_ == nullptr) {
    return false;
  }
  cracen_->PROTECTEDRAMLOCK = CRACEN_PROTECTEDRAMLOCK_ENABLE_Enabled;
  return true;
#endif
}

bool CracenIkg::softResetKeys(uint32_t spinLimit) {
#if defined(NRF_TRUSTZONE_NONSECURE)
  (void)spinLimit;
  return false;
#else
  if (core_ == nullptr) {
    return false;
  }
  core_->IKG.SOFTRST = CRACENCORE_IKG_SOFTRST_SOFTRST_KEY;
  core_->IKG.SOFTRST = CRACENCORE_IKG_SOFTRST_SOFTRST_NORMAL;
  return waitReady(spinLimit);
#endif
}

bool CracenIkg::initInput() {
#if defined(NRF_TRUSTZONE_NONSECURE)
  return false;
#else
  if (core_ == nullptr) {
    return false;
  }
  core_->IKG.INITDATA = CRACENCORE_IKG_INITDATA_INITDATA_Msk;
  return true;
#endif
}

bool CracenIkg::writeNonce(const uint32_t* words, size_t wordCount) {
#if defined(NRF_TRUSTZONE_NONSECURE)
  (void)words;
  (void)wordCount;
  return false;
#else
  if (core_ == nullptr || (wordCount != 0U && words == nullptr)) {
    return false;
  }
  for (size_t i = 0; i < wordCount; ++i) {
    core_->IKG.NONCE = words[i];
  }
  return true;
#endif
}

bool CracenIkg::writePersonalization(const uint32_t* words, size_t wordCount) {
#if defined(NRF_TRUSTZONE_NONSECURE)
  (void)words;
  (void)wordCount;
  return false;
#else
  if (core_ == nullptr || (wordCount != 0U && words == nullptr)) {
    return false;
  }
  for (size_t i = 0; i < wordCount; ++i) {
    core_->IKG.PERSONALISATIONSTRING = words[i];
  }
  return true;
#endif
}

bool CracenIkg::setReseedInterval(uint64_t interval) {
#if defined(NRF_TRUSTZONE_NONSECURE)
  (void)interval;
  return false;
#else
  if (core_ == nullptr) {
    return false;
  }
  core_->IKG.RESEEDINTERVALLSB = static_cast<uint32_t>(interval & 0xFFFFFFFFULL);
  core_->IKG.RESEEDINTERVALMSB =
      static_cast<uint32_t>((interval >> 32) & 0xFFFFULL);
  return true;
#endif
}

