lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal_security.cpp
bool CracenIkg::start(uint32_t spinLimit) {
#if defined(NRF_TRUSTZONE_NONSECURE)
  (void)spinLimit;
  return false;
#else
  if (!active_ && !begin(spinLimit)) {
    return false;
  }
  if (core_ == nullptr) {
    return false;
  }

  clearEvent();
  core_->IKG.START = CRACENCORE_IKG_START_START_Msk;
  return waitGenerationComplete(spinLimit);
#endif
}

bool CracenIkg::waitReady(uint32_t spinLimit) const {
  if (core_ == nullptr) {
    return false;
  }
  while (spinLimit-- > 0U) {
    const uint32_t ikgStatus = core_->IKG.STATUS;
    const uint32_t pke = core_->IKG.PKESTATUS;
    if ((ikgStatus & CRACENCORE_IKG_STATUS_CATASTROPHICERROR_Msk) != 0U) {
      return false;
    }
    if ((ikgStatus & CRACENCORE_IKG_STATUS_CTRDRBGBUSY_Msk) == 0U &&
        (pke & CRACENCORE_IKG_PKESTATUS_ERASEBUSY_Msk) == 0U) {
      return true;
    }
  }
  return false;
}

bool CracenIkg::waitGenerationComplete(uint32_t spinLimit) const {
  if (core_ == nullptr) {
    return false;
  }
  while (spinLimit-- > 0U) {
    const uint32_t currentStatus = core_->IKG.STATUS;
    if ((currentStatus & (CRACENCORE_IKG_STATUS_SEEDERROR_Msk |
                          CRACENCORE_IKG_STATUS_ENTROPYERROR_Msk |
                          CRACENCORE_IKG_STATUS_CATASTROPHICERROR_Msk)) != 0U) {
      return false;
    }
    if ((currentStatus & CRACENCORE_IKG_STATUS_OKAY_Msk) != 0U &&
        (currentStatus & CRACENCORE_IKG_STATUS_CTRDRBGBUSY_Msk) == 0U) {
      return true;
    }
  }
  return false;
}

Tampc::Tampc(uint32_t base)
    : tampc_(base == 0U ? nullptr : reinterpret_cast<NRF_TAMPC_Type*>(base)) {}

uint32_t Tampc::status() const {
  return (tampc_ == nullptr) ? 0U : tampc_->STATUS;
}

bool Tampc::tamperDetected() const {
  return (status() & (TAMPC_STATUS_ACTIVESHIELD_Msk | TAMPC_STATUS_PROTECT_Msk |
                      TAMPC_STATUS_CRACENTAMP_Msk |
                      TAMPC_STATUS_GLITCHSLOWDOMAIN0_Msk |
                      TAMPC_STATUS_GLITCHFASTDOMAIN0_Msk |
                      TAMPC_STATUS_GLITCHFASTDOMAIN1_Msk |
                      TAMPC_STATUS_GLITCHFASTDOMAIN2_Msk |
                      TAMPC_STATUS_GLITCHFASTDOMAIN3_Msk)) != 0U;
}

bool Tampc::writeErrorDetected() const {
  if (tampc_ == nullptr) {
    return false;
  }
  return ((tampc_->EVENTS_WRITEERROR &
           TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Msk) >>
          TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Pos) ==
         TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Generated;
}

bool Tampc::pollTamper(bool clearEvent) {
  if (tampc_ == nullptr) {
    return false;
  }
  const bool signaled =
      ((tampc_->EVENTS_TAMPER & TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Msk) >>
       TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Pos) ==
      TAMPC_EVENTS_TAMPER_EVENTS_TAMPER_Generated;
  if (signaled && clearEvent) {
    tampc_->EVENTS_TAMPER = 0U;
  }
  return signaled;
}

bool Tampc::pollWriteError(bool clearEvent) {
  if (tampc_ == nullptr) {
    return false;
  }
  const bool signaled =
      ((tampc_->EVENTS_WRITEERROR &
        TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Msk) >>
       TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Pos) ==
      TAMPC_EVENTS_WRITEERROR_EVENTS_WRITEERROR_Generated;
  if (signaled && clearEvent) {
    tampc_->EVENTS_WRITEERROR = 0U;
  }
  return signaled;
}

void Tampc::clearEvents() {
  if (tampc_ == nullptr) {
    return;
  }
  tampc_->EVENTS_TAMPER = 0U;
  tampc_->EVENTS_WRITEERROR = 0U;
}

void Tampc::enableInterrupts(bool tamper, bool writeError) {
  if (tampc_ == nullptr) {
    return;
  }
  uint32_t enableMask = 0U;
  uint32_t clearMask = 0U;
  if (tamper) {
    enableMask |= TAMPC_INTENSET_TAMPER_Msk;
  } else {
    clearMask |= TAMPC_INTENCLR_TAMPER_Msk;
  }
  if (writeError) {
    enableMask |= TAMPC_INTENSET_WRITEERROR_Msk;
  } else {
    clearMask |= TAMPC_INTENCLR_WRITEERROR_Msk;
  }
  if (enableMask != 0U) {
    tampc_->INTENSET = enableMask;
  }
  if (clearMask != 0U) {
    tampc_->INTENCLR = clearMask;
  }
}

bool Tampc::pendingTamperInterrupt() const {
  return (tampc_ != nullptr) &&
         ((tampc_->INTPEND & TAMPC_INTPEND_TAMPER_Msk) != 0U);
}

bool Tampc::pendingWriteErrorInterrupt() const {
  return (tampc_ != nullptr) &&
         ((tampc_->INTPEND & TAMPC_INTPEND_WRITEERROR_Msk) != 0U);
}

bool Tampc::writeProtectedControl(volatile uint32_t& ctrlRegister,
                                  uint32_t valueHigh,
                                  uint32_t valueLow,
                                  bool enable,
                                  bool lock) {
#if defined(NRF_TRUSTZONE_NONSECURE)
  (void)ctrlRegister;
  (void)valueHigh;
  (void)valueLow;
  (void)enable;
  (void)lock;
  return false;
#else
  if (tampc_ == nullptr) {
    return false;
  }
  ctrlRegister = kTampcWriteKey | kTampcWriteProtectionClear;
  ctrlRegister = kTampcWriteKey |
                 (enable ? valueHigh : valueLow) |
                 (lock ? kTampcLockEnabled : 0U);
  return !pollWriteError(false);
#endif
}

bool Tampc::setInternalResetOnTamper(bool enable, bool lock) {
  return writeProtectedControl(
      tampc_->PROTECT.INTRESETEN.CTRL,
      (TAMPC_PROTECT_INTRESETEN_CTRL_VALUE_High
       << TAMPC_PROTECT_INTRESETEN_CTRL_VALUE_Pos),
      (TAMPC_PROTECT_INTRESETEN_CTRL_VALUE_Low
       << TAMPC_PROTECT_INTRESETEN_CTRL_VALUE_Pos),
      enable, lock);
}

bool Tampc::setExternalResetOnTamper(bool enable, bool lock) {
  return writeProtectedControl(
      tampc_->PROTECT.EXTRESETEN.CTRL,
      (TAMPC_PROTECT_EXTRESETEN_CTRL_VALUE_High
       << TAMPC_PROTECT_EXTRESETEN_CTRL_VALUE_Pos),
      (TAMPC_PROTECT_EXTRESETEN_CTRL_VALUE_Low
       << TAMPC_PROTECT_EXTRESETEN_CTRL_VALUE_Pos),
      enable, lock);
}

bool Tampc::setEraseProtect(bool enable, bool lock) {
  return writeProtectedControl(
      tampc_->PROTECT.ERASEPROTECT.CTRL,
      (TAMPC_PROTECT_ERASEPROTECT_CTRL_VALUE_High
       << TAMPC_PROTECT_ERASEPROTECT_CTRL_VALUE_Pos),
      (TAMPC_PROTECT_ERASEPROTECT_CTRL_VALUE_Low
       << TAMPC_PROTECT_ERASEPROTECT_CTRL_VALUE_Pos),
      enable, lock);
}

bool Tampc::setCracenTamperMonitor(bool enable, bool lock) {
  return writeProtectedControl(
      tampc_->PROTECT.CRACENTAMP.CTRL,
      (TAMPC_PROTECT_CRACENTAMP_CTRL_VALUE_High
       << TAMPC_PROTECT_CRACENTAMP_CTRL_VALUE_Pos),
      (TAMPC_PROTECT_CRACENTAMP_CTRL_VALUE_Low
       << TAMPC_PROTECT_CRACENTAMP_CTRL_VALUE_Pos),
      enable, lock);
}

bool Tampc::setActiveShieldMonitor(bool enable, bool lock) {
  return writeProtectedControl(
      tampc_->PROTECT.ACTIVESHIELD.CTRL,
      (TAMPC_PROTECT_ACTIVESHIELD_CTRL_VALUE_High
       << TAMPC_PROTECT_ACTIVESHIELD_CTRL_VALUE_Pos),
      (TAMPC_PROTECT_ACTIVESHIELD_CTRL_VALUE_Low
       << TAMPC_PROTECT_ACTIVESHIELD_CTRL_VALUE_Pos),
      enable, lock);
}

