lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal_security.cpp
bool Tampc::setGlitchSlowMonitor(bool enable, bool lock) {
  return writeProtectedControl(
      tampc_->PROTECT.GLITCHSLOWDOMAIN.CTRL,
      (TAMPC_PROTECT_GLITCHSLOWDOMAIN_CTRL_VALUE_High
       << TAMPC_PROTECT_GLITCHSLOWDOMAIN_CTRL_VALUE_Pos),
      (TAMPC_PROTECT_GLITCHSLOWDOMAIN_CTRL_VALUE_Low
       << TAMPC_PROTECT_GLITCHSLOWDOMAIN_CTRL_VALUE_Pos),
      enable, lock);
}

bool Tampc::setGlitchFastMonitor(bool enable, bool lock) {
  return writeProtectedControl(
      tampc_->PROTECT.GLITCHFASTDOMAIN.CTRL,
      (TAMPC_PROTECT_GLITCHFASTDOMAIN_CTRL_VALUE_High
       << TAMPC_PROTECT_GLITCHFASTDOMAIN_CTRL_VALUE_Pos),
      (TAMPC_PROTECT_GLITCHFASTDOMAIN_CTRL_VALUE_Low
       << TAMPC_PROTECT_GLITCHFASTDOMAIN_CTRL_VALUE_Pos),
      enable, lock);
}

bool Tampc::setActiveShieldChannelMask(uint8_t channelMask) {
#if defined(NRF_TRUSTZONE_NONSECURE)
  (void)channelMask;
  return false;
#else
  if (tampc_ == nullptr) {
    return false;
  }
  tampc_->ACTIVESHIELD.CHEN = static_cast<uint32_t>(channelMask & 0x0FU);
  return true;
#endif
}

uint8_t Tampc::activeShieldChannelMask() const {
  if (tampc_ == nullptr) {
    return 0U;
  }
  return static_cast<uint8_t>(tampc_->ACTIVESHIELD.CHEN & 0x0FU);
}

bool Tampc::activeShieldChannelEnabled(uint8_t channel) const {
  if (channel > 3U) {
    return false;
  }
  return (activeShieldChannelMask() & static_cast<uint8_t>(1U << channel)) != 0U;
}

bool Tampc::setActiveShieldChannelEnabled(uint8_t channel, bool enable) {
  if (channel > 3U) {
    return false;
  }
  uint8_t mask = activeShieldChannelMask();
  if (enable) {
    mask = static_cast<uint8_t>(mask | static_cast<uint8_t>(1U << channel));
  } else {
    mask = static_cast<uint8_t>(mask & ~static_cast<uint8_t>(1U << channel));
  }
  return setActiveShieldChannelMask(mask);
}

bool Tampc::internalResetOnTamperEnabled() const {
  return protectedSignalEnabled(tampc_->PROTECT.INTRESETEN.CTRL);
}

bool Tampc::externalResetOnTamperEnabled() const {
  return protectedSignalEnabled(tampc_->PROTECT.EXTRESETEN.CTRL);
}

bool Tampc::eraseProtectEnabled() const {
  return protectedSignalEnabled(tampc_->PROTECT.ERASEPROTECT.CTRL);
}

bool Tampc::cracenTamperMonitorEnabled() const {
  return protectedSignalEnabled(tampc_->PROTECT.CRACENTAMP.CTRL);
}

bool Tampc::activeShieldMonitorEnabled() const {
  return protectedSignalEnabled(tampc_->PROTECT.ACTIVESHIELD.CTRL);
}

bool Tampc::glitchSlowMonitorEnabled() const {
  return protectedSignalEnabled(tampc_->PROTECT.GLITCHSLOWDOMAIN.CTRL);
}

bool Tampc::glitchFastMonitorEnabled() const {
  return protectedSignalEnabled(tampc_->PROTECT.GLITCHFASTDOMAIN.CTRL);
}

bool Tampc::domainDbgenEnabled(uint8_t domain) const {
  return validDomainIndex(domain) &&
         protectedSignalEnabled(tampc_->PROTECT.DOMAIN[domain].DBGEN.CTRL);
}

bool Tampc::domainNidenEnabled(uint8_t domain) const {
  return validDomainIndex(domain) &&
         protectedSignalEnabled(tampc_->PROTECT.DOMAIN[domain].NIDEN.CTRL);
}

bool Tampc::domainSpidenEnabled(uint8_t domain) const {
  return validDomainIndex(domain) &&
         protectedSignalEnabled(tampc_->PROTECT.DOMAIN[domain].SPIDEN.CTRL);
}

bool Tampc::domainSpnidenEnabled(uint8_t domain) const {
  return validDomainIndex(domain) &&
         protectedSignalEnabled(tampc_->PROTECT.DOMAIN[domain].SPNIDEN.CTRL);
}

bool Tampc::apDbgenEnabled(uint8_t ap) const {
  return validApIndex(ap) &&
         protectedSignalEnabled(tampc_->PROTECT.AP[ap].DBGEN.CTRL);
}

bool Tampc::setDomainDbgen(bool enable, bool lock, uint8_t domain) {
  return validDomainIndex(domain) &&
         writeProtectedControl(
             tampc_->PROTECT.DOMAIN[domain].DBGEN.CTRL,
             (TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_VALUE_High
              << TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_VALUE_Pos),
             (TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_VALUE_Low
              << TAMPC_PROTECT_DOMAIN_DBGEN_CTRL_VALUE_Pos),
             enable, lock);
}

bool Tampc::setDomainNiden(bool enable, bool lock, uint8_t domain) {
  return validDomainIndex(domain) &&
         writeProtectedControl(
             tampc_->PROTECT.DOMAIN[domain].NIDEN.CTRL,
             (TAMPC_PROTECT_DOMAIN_NIDEN_CTRL_VALUE_High
              << TAMPC_PROTECT_DOMAIN_NIDEN_CTRL_VALUE_Pos),
             (TAMPC_PROTECT_DOMAIN_NIDEN_CTRL_VALUE_Low
              << TAMPC_PROTECT_DOMAIN_NIDEN_CTRL_VALUE_Pos),
             enable, lock);
}

bool Tampc::setDomainSpiden(bool enable, bool lock, uint8_t domain) {
  return validDomainIndex(domain) &&
         writeProtectedControl(
             tampc_->PROTECT.DOMAIN[domain].SPIDEN.CTRL,
             (TAMPC_PROTECT_DOMAIN_SPIDEN_CTRL_VALUE_High
              << TAMPC_PROTECT_DOMAIN_SPIDEN_CTRL_VALUE_Pos),
             (TAMPC_PROTECT_DOMAIN_SPIDEN_CTRL_VALUE_Low
              << TAMPC_PROTECT_DOMAIN_SPIDEN_CTRL_VALUE_Pos),
             enable, lock);
}

bool Tampc::setDomainSpniden(bool enable, bool lock, uint8_t domain) {
  return validDomainIndex(domain) &&
         writeProtectedControl(
             tampc_->PROTECT.DOMAIN[domain].SPNIDEN.CTRL,
             (TAMPC_PROTECT_DOMAIN_SPNIDEN_CTRL_VALUE_High
              << TAMPC_PROTECT_DOMAIN_SPNIDEN_CTRL_VALUE_Pos),
             (TAMPC_PROTECT_DOMAIN_SPNIDEN_CTRL_VALUE_Low
              << TAMPC_PROTECT_DOMAIN_SPNIDEN_CTRL_VALUE_Pos),
             enable, lock);
}

bool Tampc::setApDbgen(bool enable, bool lock, uint8_t ap) {
  return validApIndex(ap) &&
         writeProtectedControl(
             tampc_->PROTECT.AP[ap].DBGEN.CTRL,
             (TAMPC_PROTECT_AP_DBGEN_CTRL_VALUE_High
              << TAMPC_PROTECT_AP_DBGEN_CTRL_VALUE_Pos),
             (TAMPC_PROTECT_AP_DBGEN_CTRL_VALUE_Low
              << TAMPC_PROTECT_AP_DBGEN_CTRL_VALUE_Pos),
             enable, lock);
}

bool Tampc::protectStatusError() const {
  return tamperDetected() || writeErrorDetected();
}

bool Tampc::cracenTamperStatusError() const {
  return protectedStatusError(tampc_->PROTECT.CRACENTAMP.STATUS);
}

bool Tampc::activeShieldStatusError() const {
  return protectedStatusError(tampc_->PROTECT.ACTIVESHIELD.STATUS);
}

bool Tampc::glitchSlowStatusError() const {
  return protectedStatusError(tampc_->PROTECT.GLITCHSLOWDOMAIN.STATUS);
}

bool Tampc::glitchFastStatusError() const {
  return protectedStatusError(tampc_->PROTECT.GLITCHFASTDOMAIN.STATUS);
}

bool Tampc::intResetStatusError() const {
  return protectedStatusError(tampc_->PROTECT.INTRESETEN.STATUS);
}

bool Tampc::extResetStatusError() const {
  return protectedStatusError(tampc_->PROTECT.EXTRESETEN.STATUS);
}

bool Tampc::eraseProtectStatusError() const {
  return protectedStatusError(tampc_->PROTECT.ERASEPROTECT.STATUS);
}

bool Tampc::domainDbgenStatusError(uint8_t domain) const {
  return validDomainIndex(domain) &&
         protectedStatusError(tampc_->PROTECT.DOMAIN[domain].DBGEN.STATUS);
}

bool Tampc::domainNidenStatusError(uint8_t domain) const {
  return validDomainIndex(domain) &&
         protectedStatusError(tampc_->PROTECT.DOMAIN[domain].NIDEN.STATUS);
}

bool Tampc::domainSpidenStatusError(uint8_t domain) const {
  return validDomainIndex(domain) &&
         protectedStatusError(tampc_->PROTECT.DOMAIN[domain].SPIDEN.STATUS);
}

bool Tampc::domainSpnidenStatusError(uint8_t domain) const {
  return validDomainIndex(domain) &&
         protectedStatusError(tampc_->PROTECT.DOMAIN[domain].SPNIDEN.STATUS);
}

bool Tampc::apDbgenStatusError(uint8_t ap) const {
  return validApIndex(ap) &&
         protectedStatusError(tampc_->PROTECT.AP[ap].DBGEN.STATUS);
}

bool Tampc::protectedSignalEnabled(const volatile uint32_t& ctrlRegister) const {
  return (static_cast<uint32_t>(ctrlRegister) & 0x1U) != 0U;
}

bool Tampc::protectedStatusError(const volatile uint32_t& statusRegister) const {
  return (static_cast<uint32_t>(statusRegister) & 0x1U) != 0U;
}

bool Tampc::validDomainIndex(uint8_t domain) const {
  return (tampc_ != nullptr) && (domain < TAMPC_PROTECT_DOMAIN_MaxCount);
}

bool Tampc::validApIndex(uint8_t ap) const {
  return (tampc_ != nullptr) && (ap < TAMPC_PROTECT_AP_MaxCount);
}

}  // namespace xiao_nrf54l15
